# SelectedIFCItem Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExternalServiceUIData..::..SelectedIFCItem Property
IFCExternalServiceUIData Class See Also
---
The selected IFC Item (can be IFC Entity, or PredefinedType)
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string SelectedIFCItem { get; set; }
```

Visual Basic
---
```text
Public Property SelectedIFCItem As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SelectedIFCItem {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace